#### Terraform Format and Style 🖌``
Environment: dev
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.eks_blueprints_kubernetes_addons.data.aws_region.current: Reading...
module.eks_blueprints_kubernetes_addons.data.aws_partition.current: Reading...
module.eks_blueprints_kubernetes_addons.data.aws_region.current: Read complete after 0s [id=ap-southeast-2]
module.eks_blueprints.module.aws_eks.data.aws_partition.current: Reading...
data.aws_caller_identity.current: Reading...
module.eks_blueprints.data.aws_caller_identity.current: Reading...
module.eks_blueprints_kubernetes_addons.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_blueprints.data.aws_partition.current: Reading...
module.eks_blueprints.data.aws_region.current: Reading...
data.aws_availability_zones.available: Reading...
data.aws_caller_identity.default: Reading...
data.aws_region.current: Reading...
module.eks_blueprints.module.aws_eks.module.kms.data.aws_partition.current: Reading...
module.eks_blueprints.module.aws_eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_blueprints.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_blueprints.data.aws_region.current: Read complete after 0s [id=ap-southeast-2]
data.aws_region.current: Read complete after 0s [id=ap-southeast-2]
module.eks_blueprints.module.aws_eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_blueprints.module.aws_eks.data.aws_caller_identity.current: Reading...
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-034f697d05267b01e]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-03450afa57a6288df]
module.eks_blueprints_kubernetes_addons.data.aws_caller_identity.current: Reading...
module.eks_blueprints.module.aws_eks.module.kms.data.aws_caller_identity.current: Reading...
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2053943846]
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::158237136693:policy/vpc-flow-log-to-cloudwatch-20221022101602450100000001]
data.aws_caller_identity.current: Read complete after 0s [id=158237136693]
module.eks_blueprints.module.aws_eks.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=158237136693]
module.eks_blueprints.data.aws_caller_identity.current: Read complete after 0s [id=158237136693]
module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20221022101602452100000002]
module.eks_blueprints.data.aws_iam_session_context.current: Reading...
data.aws_caller_identity.default: Read complete after 0s [id=158237136693]
module.eks_blueprints.module.aws_eks.data.aws_caller_identity.current: Read complete after 0s [id=158237136693]
module.eks_blueprints.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::158237136693:user/service.infra-k8s.deployer]
module.eks_blueprints.module.aws_eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_blueprints.module.aws_eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
data.aws_availability_zones.available: Read complete after 0s [id=ap-southeast-2]
module.eks_blueprints.data.aws_iam_policy_document.eks_key: Reading...
module.eks_blueprints.module.aws_eks.aws_iam_role.this[0]: Refreshing state... [id=django-for-impatient-cluster-role]
module.eks_blueprints_kubernetes_addons.data.aws_caller_identity.current: Read complete after 0s [id=158237136693]
module.eks_blueprints.data.aws_iam_policy_document.eks_key: Read complete after 0s [id=4025009984]
module.eks_blueprints.module.kms[0].aws_kms_key.this: Refreshing state... [id=8d8bc25a-678c-4493-ad07-7d2e215c3c1a]
module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20221022101602452100000002-20221022101603510300000003]
module.eks_blueprints.module.aws_eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=django-for-impatient-cluster-role-20221022104049372300000004]
module.eks_blueprints.module.aws_eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=django-for-impatient-cluster-role-20221022104049358700000003]
module.eks_blueprints.module.kms[0].aws_kms_alias.this: Refreshing state... [id=alias/django-for-impatient]
module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-03450afa57a6288df]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-039b53d79664f15ea]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-03e0c337a4a53b1c6]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0cea5a00b2c07fe34]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0ffab94f437dfb623]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-088414014b168aae0]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-06953b6631b897b53]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-06b2923dedb8e64b3]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00907bce6cbcc6b47]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0bbfe145c7abf377f]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0d639fd63ce2ba601]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0ad8fb60c88cb7fe9]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-096a58e583e0ac47c]
module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-05000514d72d54e9c]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-08d5a0fbd25a558cd]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-006e44e2327f6304e]
module.eks_blueprints.module.aws_eks.aws_security_group.node[0]: Refreshing state... [id=sg-0f59e37d6370a61c1]
module.eks_blueprints.module.aws_eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0e312562fe97033cb]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06953b6631b897b531080289494]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0443c0238a54bcbe5]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ef380c7e09deffa6]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-029ed30db96eaa5fd]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-01adb055e884040f2]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-028dca37fad47a0cd]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0746a4928e69fa71c]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0ebf8b4682b095f4e]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=infra-k8s]
module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0fe0c6935f00b0a3a]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0025f0003669e533e]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-06fb9bbd7518f2d9f]
module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-0feb2e13632470598]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2952322807]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_ntp_udp"]: Refreshing state... [id=sgrule-85039100]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-2756808687]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-195525912]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_ntp_tcp"]: Refreshing state... [id=sgrule-2073015025]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-4238488871]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-260035800]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_cluster_443"]: Refreshing state... [id=sgrule-591942786]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_self_coredns_tcp"]: Refreshing state... [id=sgrule-742987524]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_self_coredns_udp"]: Refreshing state... [id=sgrule-2720961890]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["egress_nodes_kubelet"]: Refreshing state... [id=sgrule-278850341]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3807632150]
module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["egress_nodes_443"]: Refreshing state... [id=sgrule-457845762]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-039b53d79664f15ea1080289494]
module.eks_blueprints.module.aws_eks.aws_eks_cluster.this[0]: Refreshing state... [id=django-for-impatient]
module.eks_blueprints.module.aws_eks.data.tls_certificate.this[0]: Reading...
module.eks_blueprints.module.aws_eks.aws_ec2_tag.cluster_primary_security_group["GithubRepo"]: Refreshing state... [id=sg-0cb77f68314481fa4,GithubRepo]
module.eks_blueprints.data.aws_eks_cluster.cluster[0]: Reading...
module.eks_blueprints.module.aws_eks.aws_ec2_tag.cluster_primary_security_group["GithubOrg"]: Refreshing state... [id=sg-0cb77f68314481fa4,GithubOrg]
module.eks_blueprints.module.aws_eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0cb77f68314481fa4,Environment]
module.eks_blueprints.module.aws_eks.aws_ec2_tag.cluster_primary_security_group["DeployedBy"]: Refreshing state... [id=sg-0cb77f68314481fa4,DeployedBy]
data.aws_eks_cluster_auth.this: Reading...
data.aws_eks_addon_version.latest["kube-proxy"]: Reading...
data.aws_eks_addon_version.latest["vpc-cni"]: Reading...
data.aws_eks_cluster_auth.this: Read complete after 0s [id=django-for-impatient]
module.eks_blueprints.data.aws_eks_cluster.cluster[0]: Read complete after 0s [id=django-for-impatient]
module.eks_blueprints.data.http.eks_cluster_readiness[0]: Reading...
module.eks_blueprints_kubernetes_addons.module.argocd[0].kubernetes_namespace_v1.this[0]: Refreshing state... [id=argocd]
module.eks_blueprints_kubernetes_addons.module.fargate_fluentbit[0].kubernetes_namespace.aws_observability: Refreshing state... [id=aws-observability]
data.aws_eks_addon_version.latest["vpc-cni"]: Read complete after 0s [id=vpc-cni]
data.aws_eks_addon_version.latest["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks_blueprints.module.aws_eks.data.tls_certificate.this[0]: Read complete after 1s [id=46adad793ade1fb181af4d4f685addbc37aa907c]
module.eks_blueprints.module.aws_eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::158237136693:oidc-provider/oidc.eks.ap-southeast-2.amazonaws.com/id/2865CC1660B5C3EF8DF0B469B436CB54]
module.eks_blueprints.data.http.eks_cluster_readiness[0]: Read complete after 1s [id=https://2865CC1660B5C3EF8DF0B469B436CB54.gr7.ap-southeast-2.eks.amazonaws.com/healthz]
module.eks_blueprints.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks_blueprints.module.aws_eks_fargate_profiles["default"].aws_iam_role.fargate[0]: Refreshing state... [id=django-for-impatient-default]
module.eks_blueprints.module.aws_eks_fargate_profiles["default"].aws_iam_policy.cwlogs[0]: Refreshing state... [id=arn:aws:iam::158237136693:policy/django-for-impatient-default-cwlogs]
module.eks_blueprints.module.aws_eks_fargate_profiles["default"].aws_iam_role_policy_attachment.cwlogs[0]: Refreshing state... [id=django-for-impatient-default-20221022105123637900000009]
module.eks_blueprints.module.aws_eks_fargate_profiles["default"].aws_iam_role_policy_attachment.fargate_pod_execution_role_policy["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"]: Refreshing state... [id=django-for-impatient-default-20221022105123628600000008]
module.eks_blueprints.module.aws_eks_fargate_profiles["default"].aws_eks_fargate_profile.eks_fargate: Refreshing state... [id=django-for-impatient:default]
module.eks_blueprints_kubernetes_addons.time_sleep.dataplane: Refreshing state... [id=2022-10-22T12:11:17Z]
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].data.aws_eks_addon_version.this: Reading...
module.eks_blueprints_kubernetes_addons.module.aws_kube_proxy[0].data.aws_eks_addon_version.this: Reading...
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].time_sleep.this: Refreshing state... [id=2022-10-22T10:56:20Z]
module.eks_blueprints_kubernetes_addons.module.fargate_fluentbit[0].kubernetes_config_map.aws_logging: Refreshing state... [id=aws-observability/aws-logging]
module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].data.aws_eks_addon_version.this: Reading...
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].data.aws_eks_cluster_auth.this: Reading...
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].data.aws_eks_cluster_auth.this: Read complete after 0s [id=django-for-impatient]
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].null_resource.remove_default_coredns_deployment[0]: Refreshing state... [id=6989773204784446481]
module.eks_blueprints_kubernetes_addons.module.argocd[0].module.helm_addon.helm_release.addon[0]: Refreshing state... [id=argo-cd]
module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].module.irsa_addon[0].aws_iam_role.irsa[0]: Refreshing state... [id=django-for-impatient-aws-node-irsa]
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].data.aws_iam_policy_document.aws_lb: Reading...
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].module.cluster_proportional_autoscaler[0].module.helm_addon.helm_release.addon[0]: Refreshing state... [id=cluster-proportional-autoscaler]
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].null_resource.modify_kube_dns[0]: Refreshing state... [id=5032259336032441595]
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].data.aws_iam_policy_document.aws_lb: Read complete after 0s [id=2633998141]
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].aws_iam_policy.aws_load_balancer_controller: Refreshing state... [id=arn:aws:iam::158237136693:policy/django-for-impatient-lb-irsa]
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.module.irsa[0].aws_iam_role.irsa[0]: Refreshing state... [id=django-for-impatient-aws-load-balancer-controller-sa-irsa]
module.eks_blueprints_kubernetes_addons.module.aws_kube_proxy[0].data.aws_eks_addon_version.this: Read complete after 0s [id=kube-proxy]
module.eks_blueprints_kubernetes_addons.module.aws_kube_proxy[0].aws_eks_addon.kube_proxy: Refreshing state... [id=django-for-impatient:kube-proxy]
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].data.aws_eks_addon_version.this: Read complete after 0s [id=coredns]
module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].module.helm_addon[0].helm_release.addon[0]: Refreshing state... [id=coredns]
module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].data.aws_eks_addon_version.this: Read complete after 0s [id=vpc-cni]
module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].module.irsa_addon[0].aws_iam_role_policy_attachment.irsa[0]: Refreshing state... [id=django-for-impatient-aws-node-irsa-2022102210552081890000000d]
module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].aws_eks_addon.vpc_cni: Refreshing state... [id=django-for-impatient:vpc-cni]
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.module.irsa[0].kubernetes_service_account_v1.irsa[0]: Refreshing state... [id=kube-system/aws-load-balancer-controller-sa]
module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.module.irsa[0].aws_iam_role_policy_attachment.irsa[0]: Refreshing state... [id=django-for-impatient-aws-load-balancer-controller-sa-irsa-2022102210552092860000000e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks_blueprints.kubernetes_config_map.aws_auth[0] will be updated in-place
  ~ resource "kubernetes_config_map" "aws_auth" {
      ~ data        = {
          ~ "mapRoles"    = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  - "system:node-proxier"
              +   "rolearn": "arn:aws:iam::158237136693:role/django-for-impatient-apps"
              +   "username": "system:node:{{SessionName}}"
              + - "groups":
              +   - "system:bootstrappers"
              +   - "system:nodes"
              +   - "system:node-proxier"
              +   "rolearn": "arn:aws:iam::158237136693:role/django-for-impatient-argocd"
              +   "username": "system:node:{{SessionName}}"
              + - "groups":
              +   - "system:bootstrappers"
              +   - "system:nodes"
              +   - "system:node-proxier"
                  "rolearn": "arn:aws:iam::158237136693:role/django-for-impatient-default"
                  "username": "system:node:{{SessionName}}"
                - "groups":
              +   - "system:bootstrappers"
              +   - "system:nodes"
              +   - "system:node-proxier"
              +   "rolearn": "arn:aws:iam::158237136693:role/django-for-impatient-kube-system"
              +   "username": "system:node:{{SessionName}}"
              + - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::158237136693:role/AWSReservedSSO_AdministratorAccess_17b27ee099385ed9"
                  "username": "ops-role"
            EOT
            # (2 unchanged elements hidden)
        }
        id          = "kube-system/aws-auth"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks_blueprints_kubernetes_addons.data.aws_eks_cluster.eks_cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "eks_cluster" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "django-for-impatient"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.eks_blueprints_kubernetes_addons.time_sleep.dataplane must be replaced
-/+ resource "time_sleep" "dataplane" {
      ~ id              = "2022-10-22T12:11:17Z" -> (known after apply)
      ~ triggers        = { # forces replacement
          ~ "data_plane_wait_arn" = "arn:aws:eks:ap-southeast-2:158237136693:fargateprofile/django-for-impatient/default/a0c1ffcd-2bc2-4caf-7d33-647290ae997b" -> (known after apply)
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["apps"].data.aws_iam_policy_document.cwlogs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "cwlogs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["apps"].data.aws_iam_policy_document.fargate_assume_role_policy[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "fargate_assume_role_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "EKSFargateAssumeRole"

          + principals {
              + identifiers = [
                  + "eks-fargate-pods.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["apps"].aws_eks_fargate_profile.eks_fargate will be created
  + resource "aws_eks_fargate_profile" "eks_fargate" {
      + arn                    = (known after apply)
      + cluster_name           = "django-for-impatient"
      + fargate_profile_name   = "apps"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-088414014b168aae0",
          + "subnet-0ad8fb60c88cb7fe9",
          + "subnet-0d639fd63ce2ba601",
        ]
      + tags                   = {
          + "DeployedBy"                                 = "Terraform"
          + "Environment"                                = "dev"
          + "GithubOrg"                                  = "ethanbayliss"
          + "GithubRepo"                                 = "infra-k8s"
          + "k8s.io/cluster/django-for-impatient"        = "owned"
          + "kubernetes.io/cluster/django-for-impatient" = "owned"
        }
      + tags_all               = {
          + "DeployedBy"                                 = "Terraform"
          + "Environment"                                = "dev"
          + "GithubOrg"                                  = "ethanbayliss"
          + "GithubRepo"                                 = "infra-k8s"
          + "k8s.io/cluster/django-for-impatient"        = "owned"
          + "kubernetes.io/cluster/django-for-impatient" = "owned"
        }

      + selector {
          + namespace = "app-*"
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["apps"].aws_iam_policy.cwlogs[0] will be created
  + resource "aws_iam_policy" "cwlogs" {
      + arn         = (known after apply)
      + description = "Allow fargate profiles to write logs to CloudWatch"
      + id          = (known after apply)
      + name        = "django-for-impatient-apps-cwlogs"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + tags_all    = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["apps"].aws_iam_role.fargate[0] will be created
  + resource "aws_iam_role" "fargate" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "EKS Fargate IAM Role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "django-for-impatient-apps"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["apps"].aws_iam_role_policy_attachment.cwlogs[0] will be created
  + resource "aws_iam_role_policy_attachment" "cwlogs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "django-for-impatient-apps"
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["apps"].aws_iam_role_policy_attachment.fargate_pod_execution_role_policy["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "fargate_pod_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      + role       = "django-for-impatient-apps"
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["argocd"].data.aws_iam_policy_document.cwlogs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "cwlogs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["argocd"].data.aws_iam_policy_document.fargate_assume_role_policy[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "fargate_assume_role_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "EKSFargateAssumeRole"

          + principals {
              + identifiers = [
                  + "eks-fargate-pods.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["argocd"].aws_eks_fargate_profile.eks_fargate will be created
  + resource "aws_eks_fargate_profile" "eks_fargate" {
      + arn                    = (known after apply)
      + cluster_name           = "django-for-impatient"
      + fargate_profile_name   = "argocd"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-088414014b168aae0",
          + "subnet-0ad8fb60c88cb7fe9",
          + "subnet-0d639fd63ce2ba601",
        ]
      + tags                   = {
          + "DeployedBy"                                 = "Terraform"
          + "Environment"                                = "dev"
          + "GithubOrg"                                  = "ethanbayliss"
          + "GithubRepo"                                 = "infra-k8s"
          + "k8s.io/cluster/django-for-impatient"        = "owned"
          + "kubernetes.io/cluster/django-for-impatient" = "owned"
        }
      + tags_all               = {
          + "DeployedBy"                                 = "Terraform"
          + "Environment"                                = "dev"
          + "GithubOrg"                                  = "ethanbayliss"
          + "GithubRepo"                                 = "infra-k8s"
          + "k8s.io/cluster/django-for-impatient"        = "owned"
          + "kubernetes.io/cluster/django-for-impatient" = "owned"
        }

      + selector {
          + namespace = "argocd"
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["argocd"].aws_iam_policy.cwlogs[0] will be created
  + resource "aws_iam_policy" "cwlogs" {
      + arn         = (known after apply)
      + description = "Allow fargate profiles to write logs to CloudWatch"
      + id          = (known after apply)
      + name        = "django-for-impatient-argocd-cwlogs"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + tags_all    = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["argocd"].aws_iam_role.fargate[0] will be created
  + resource "aws_iam_role" "fargate" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "EKS Fargate IAM Role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "django-for-impatient-argocd"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["argocd"].aws_iam_role_policy_attachment.cwlogs[0] will be created
  + resource "aws_iam_role_policy_attachment" "cwlogs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "django-for-impatient-argocd"
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["argocd"].aws_iam_role_policy_attachment.fargate_pod_execution_role_policy["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "fargate_pod_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      + role       = "django-for-impatient-argocd"
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["default"].data.aws_iam_policy_document.cwlogs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "cwlogs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["default"].data.aws_iam_policy_document.fargate_assume_role_policy[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "fargate_assume_role_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "EKSFargateAssumeRole"

          + principals {
              + identifiers = [
                  + "eks-fargate-pods.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["default"].aws_eks_fargate_profile.eks_fargate must be replaced
-/+ resource "aws_eks_fargate_profile" "eks_fargate" {
      ~ arn                    = "arn:aws:eks:ap-southeast-2:158237136693:fargateprofile/django-for-impatient/default/a0c1ffcd-2bc2-4caf-7d33-647290ae997b" -> (known after apply)
      ~ id                     = "django-for-impatient:default" -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
        tags                   = {
            "DeployedBy"                                 = "Terraform"
            "Environment"                                = "dev"
            "GithubOrg"                                  = "ethanbayliss"
            "GithubRepo"                                 = "infra-k8s"
            "k8s.io/cluster/django-for-impatient"        = "owned"
            "kubernetes.io/cluster/django-for-impatient" = "owned"
        }
        # (5 unchanged attributes hidden)

      - selector { # forces replacement
          - labels    = {} -> null
          - namespace = "*" -> null
        }
      + selector { # forces replacement
          + namespace = "default"
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["default"].aws_iam_policy.cwlogs[0] will be updated in-place
  ~ resource "aws_iam_policy" "cwlogs" {
        id          = "arn:aws:iam::158237136693:policy/django-for-impatient-default-cwlogs"
        name        = "django-for-impatient-default-cwlogs"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {
            "DeployedBy"  = "Terraform"
            "Environment" = "dev"
            "GithubOrg"   = "ethanbayliss"
            "GithubRepo"  = "infra-k8s"
        }
        # (5 unchanged attributes hidden)
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["default"].aws_iam_role.fargate[0] will be updated in-place
  ~ resource "aws_iam_role" "fargate" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "eks-fargate-pods.amazonaws.com"
                        }
                      - Sid       = "EKSFargateAssumeRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "django-for-impatient-default"
        name                  = "django-for-impatient-default"
        tags                  = {
            "DeployedBy"  = "Terraform"
            "Environment" = "dev"
            "GithubOrg"   = "ethanbayliss"
            "GithubRepo"  = "infra-k8s"
        }
        # (9 unchanged attributes hidden)
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].data.aws_iam_policy_document.cwlogs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "cwlogs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].data.aws_iam_policy_document.fargate_assume_role_policy[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "fargate_assume_role_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "EKSFargateAssumeRole"

          + principals {
              + identifiers = [
                  + "eks-fargate-pods.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].aws_eks_fargate_profile.eks_fargate will be created
  + resource "aws_eks_fargate_profile" "eks_fargate" {
      + arn                    = (known after apply)
      + cluster_name           = "django-for-impatient"
      + fargate_profile_name   = "kube-system"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-088414014b168aae0",
          + "subnet-0ad8fb60c88cb7fe9",
          + "subnet-0d639fd63ce2ba601",
        ]
      + tags                   = {
          + "DeployedBy"                                 = "Terraform"
          + "Environment"                                = "dev"
          + "GithubOrg"                                  = "ethanbayliss"
          + "GithubRepo"                                 = "infra-k8s"
          + "k8s.io/cluster/django-for-impatient"        = "owned"
          + "kubernetes.io/cluster/django-for-impatient" = "owned"
        }
      + tags_all               = {
          + "DeployedBy"                                 = "Terraform"
          + "Environment"                                = "dev"
          + "GithubOrg"                                  = "ethanbayliss"
          + "GithubRepo"                                 = "infra-k8s"
          + "k8s.io/cluster/django-for-impatient"        = "owned"
          + "kubernetes.io/cluster/django-for-impatient" = "owned"
        }

      + selector {
          + namespace = "kube-system"
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].aws_iam_policy.cwlogs[0] will be created
  + resource "aws_iam_policy" "cwlogs" {
      + arn         = (known after apply)
      + description = "Allow fargate profiles to write logs to CloudWatch"
      + id          = (known after apply)
      + name        = "django-for-impatient-kube-system-cwlogs"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + tags_all    = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].aws_iam_role.fargate[0] will be created
  + resource "aws_iam_role" "fargate" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "EKS Fargate IAM Role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "django-for-impatient-kube-system"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "dev"
          + "GithubOrg"   = "ethanbayliss"
          + "GithubRepo"  = "infra-k8s"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].aws_iam_role_policy_attachment.cwlogs[0] will be created
  + resource "aws_iam_role_policy_attachment" "cwlogs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "django-for-impatient-kube-system"
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["kube_system"].aws_iam_role_policy_attachment.fargate_pod_execution_role_policy["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "fargate_pod_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      + role       = "django-for-impatient-kube-system"
    }

Plan: 17 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: ethanbayliss, Action: `pull_request`, Workflow: `Terraform Testing`*